tutorials/incompressibleFluid/rotor2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentEpsilon];

internalField   uniform 3.75e-4;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    rotor
    {
        type            epsilonWallFunction;
        value           uniform 3.75e-4;
    }

    freestream
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-4;
    }
}


// ************************************************************************* //
